Repository: dw-zhu-si/ModelHub
Catalog: packaging/Localization/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt_br, ru, zh_hant

source: Agent 协议只接受本机 Origin
ar: بروتوكول الوكيل يقبل فقط الأصل الأصلي
de: Das Agentenprotokoll akzeptiert nur natives Origin
en: Agent protocol only accepts native Origin
es: El protocolo del agente solo acepta origen nativo
fr: Le protocole de l'agent n'accepte que l'origine native
ja: エージェント プロトコルはネイティブのオリジンのみを受け入れます
ko: 에이전트 프로토콜은 기본 Origin만 허용합니다.
pt_br: O protocolo do agente aceita apenas Origin nativo
ru: Протокол агента принимает только собственный Origin
zh_hant: Agent 協議只接受本機 Origin

source: Agent 管理令牌已复制。
ar: تم نسخ رمز إدارة Agent.
de: Agent-Verwaltungstoken kopiert.
en: Agent management token copied.
es: Token de administración de Agent copiado.
fr: Jeton de gestion Agent copié.
ja: Agent管理トークンをコピーしました。
ko: Agent 관리 토큰을 복사했습니다.
pt_br: Token de gerenciamento do Agent copiado.
ru: Токен управления Agent скопирован.
zh_hant: Agent 管理令牌已複製。

source: Agent 管理令牌已更新，旧令牌立即失效。
ar: تم تحديث رمز إدارة Agent. أصبح الرمز القديم غير صالح.
de: Agent-Verwaltungstoken aktualisiert. Das alte Token ist jetzt ungültig.
en: Agent management token updated. The old token is now invalid.
es: Token de administración de Agent actualizado. El token anterior ya no es válido.
fr: Jeton de gestion Agent mis à jour. L’ancien jeton est désormais invalide.
ja: Agent管理トークンを更新しました。古いトークンは無効です。
ko: Agent 관리 토큰을 업데이트했습니다. 이전 토큰은 즉시 무효화됩니다.
pt_br: Token de gerenciamento do Agent atualizado. O token anterior agora é inválido.
ru: Токен управления Agent обновлён. Старый токен больше недействителен.
zh_hant: Agent 管理令牌已更新，舊令牌立即失效。

source: Agnes AI 中国站账户可用模型
ar: نماذج Agnes AI China المتاحة لهذا الحساب
de: Für dieses Konto verfügbare Agnes-AI-China-Modelle
en: Agnes AI China models available to this account
es: Modelos de Agnes AI China disponibles para esta cuenta
fr: Modèles Agnes AI Chine disponibles pour ce compte
ja: このアカウントで利用可能なAgnes AI中国サイトのモデル
ko: 이 계정에서 사용 가능한 Agnes AI 중국 사이트 모델
pt_br: Modelos Agnes AI China disponíveis para esta conta
ru: Модели Agnes AI China, доступные этой учётной записи
zh_hant: Agnes AI 中國站賬戶可用模型

source: Agnes AI 账户可用模型
ar: نماذج Agnes AI المتاحة لهذا الحساب
de: Für dieses Konto verfügbare Agnes-AI-Modelle
en: Agnes AI models available to this account
es: Modelos de Agnes AI disponibles para esta cuenta
fr: Modèles Agnes AI disponibles pour ce compte
ja: このアカウントで利用可能なAgnes AIモデル
ko: 이 계정에서 사용 가능한 Agnes AI 모델
pt_br: Modelos Agnes AI disponíveis para esta conta
ru: Модели Agnes AI, доступные этой учётной записи
zh_hant: Agnes AI 賬戶可用模型

source: Anthropic image_url 必须是图像
ar: يجب أن يكون image_url الإنساني صورة
de: Anthropic image_url muss ein Bild sein
en: Anthropic image_url must be an image
es: image_url antrópico debe ser una imagen
fr: L'url_image anthropique doit être une image
ja: Anthropic image_url は画像である必要があります
ko: Anthropic image_url은 이미지여야 합니다.
pt_br: Image_url antrópico deve ser uma imagem
ru: Антропный image_url должен быть изображением
zh_hant: Anthropic image_url 必須是圖像

source: Anthropic 外部图像必须使用 HTTPS 或 data URI
ar: يجب أن تستخدم الصور الخارجية الإنسانية HTTPS أو معرفات URI للبيانات
de: Anthropische externe Bilder müssen HTTPS oder Daten-URIs verwenden
en: Anthropic external images must use HTTPS or data URIs
es: Las imágenes externas antrópicas deben utilizar HTTPS o URI de datos
fr: Les images externes anthropiques doivent utiliser HTTPS ou des URI de données
ja: 人為的な外部画像は HTTPS またはデータ URI を使用する必要があります
ko: 인류 외부 이미지는 HTTPS 또는 데이터 URI를 사용해야 합니다.
pt_br: Imagens externas antrópicas devem usar HTTPS ou URIs de dados
ru: Антропные внешние изображения должны использовать HTTPS или URI данных.
zh_hant: Anthropic 外部圖像必須使用 HTTPS 或 data URI

source: Anthropic 账户可用模型
ar: نماذج Anthropic المتاحة لهذا الحساب
de: Für dieses Konto verfügbare Anthropic-Modelle
en: Anthropic models available to this account
es: Modelos de Anthropic disponibles para esta cuenta
fr: Modèles Anthropic disponibles pour ce compte
ja: Anthropic アカウントで利用可能なモデル
ko: Anthropic 계정에서 사용 가능한 모델
pt_br: Modelos Anthropic disponíveis para esta conta
ru: Модели Anthropic, доступные этой учётной записи
zh_hant: Anthropic 賬戶可用模型

source: API Key 保存失败，请查看提示。
ar: فشل حفظ مفتاح API، يرجى التحقق من المطالبة.
de: Der API-Schlüssel konnte nicht gespeichert werden. Bitte überprüfen Sie die Eingabeaufforderung.
en: API Key failed to save, please check the prompt.
es: La clave API no se pudo guardar; verifique el mensaje.
fr: La clé API n'a pas pu être enregistrée. Veuillez vérifier l'invite.
ja: API キーを保存できませんでした。プロンプトを確認してください。
ko: API 키를 저장하지 못했습니다. 메시지를 확인하세요.
pt_br: A chave de API não foi salva. Verifique o prompt.
ru: Не удалось сохранить ключ API. Проверьте подсказку.
zh_hant: API Key 保存失敗，請查看提示。

source: API Key 已删除，模型已隔离
ar: تم حذف مفتاح API، وتم عزل النموذج
de: API-Schlüssel gelöscht, Modell unter Quarantäne gestellt
en: API Key deleted, model quarantined
es: Clave API eliminada, modelo en cuarentena
fr: Clé API supprimée, modèle mis en quarantaine
ja: API キーが削除され、モデルが隔離されました
ko: API 키가 삭제되고 모델이 격리되었습니다.
pt_br: Chave de API excluída, modelo em quarentena
ru: Ключ API удален, модель помещена в карантин.
zh_hant: API Key 已刪除，模型已隔離

source: API Key 已删除；后续检测不会发起上游请求。
ar: تم حذف مفتاح واجهة برمجة التطبيقات؛ لن تؤدي الاكتشافات اللاحقة إلى بدء طلبات المنبع.
de: Der API-Schlüssel wurde gelöscht; Nachfolgende Erkennungen lösen keine Upstream-Anfragen aus.
en: The API Key has been deleted; subsequent detections will not initiate upstream requests.
es: La clave API ha sido eliminada; las detecciones posteriores no iniciarán solicitudes ascendentes.
fr: La clé API a été supprimée ; les détections ultérieures ne lanceront pas de requêtes en amont.
ja: API キーは削除されました。その後の検出ではアップストリーム リクエストは開始されません。
ko: API 키가 삭제되었습니다. 후속 감지에서는 업스트림 요청이 시작되지 않습니다.
pt_br: A chave API foi excluída; as detecções subsequentes não iniciarão solicitações upstream.
ru: Ключ API был удален; последующие обнаружения не будут инициировать восходящие запросы.
zh_hant: API Key 已刪除；後續檢測不會發起上游請求。

source: API Key 无效或已过期
ar: مفتاح API غير صالح أو منتهي الصلاحية
de: Der API-Schlüssel ist ungültig oder abgelaufen
en: The API key is invalid or expired
es: La clave API no es válida o ha caducado
fr: La clé API est invalide ou expirée
ja: API Key が無効か期限切れです
ko: API Key가 유효하지 않거나 만료되었습니다
pt_br: A chave de API é inválida ou expirou
ru: Ключ API недействителен или просрочен
zh_hant: API Key 無效或已過期

source: API 服务已停止
ar: تم إيقاف خدمة API
de: API-Dienst gestoppt
en: API service stopped
es: Servicio API detenido
fr: Service API arrêté
ja: APIサービスは停止しました
ko: API 서비스가 중지되었습니다
pt_br: Serviço de API interrompido
ru: Служба API остановлена
zh_hant: API 服務已停止

source: API 服务已停止，点击启动
ar: لقد تم إيقاف خدمة API، انقر للبدء
de: Der API-Dienst wurde gestoppt. Klicken Sie zum Starten
en: The API service has been stopped, click to start
es: El servicio API se ha detenido, haga clic para iniciar
fr: Le service API a été arrêté, cliquez pour démarrer
ja: API サービスが停止しました。クリックして開始してください
ko: API 서비스가 중지되었습니다. 시작하려면 클릭하세요.
pt_br: O serviço API foi interrompido, clique para iniciar
ru: Служба API остановлена. Нажмите, чтобы начать.
zh_hant: API 服務已停止，點擊啓動

source: API 服务正在运行，点击停止
ar: خدمة API قيد التشغيل، انقر للإيقاف
de: Der API-Dienst wird ausgeführt. Klicken Sie zum Stoppen
en: The API service is running, click to stop
es: El servicio API se está ejecutando, haga clic para detener
fr: Le service API est en cours d'exécution, cliquez pour arrêter
ja: API サービスが実行中です。クリックして停止します
ko: API 서비스가 실행 중입니다. 중지하려면 클릭하세요.
pt_br: O serviço API está em execução, clique para parar
ru: Служба API запущена. Нажмите, чтобы остановить.
zh_hant: API 服務正在運行，點擊停止

source: API 服务运行中
ar: خدمة API قيد التشغيل
de: API-Dienst läuft
en: API service running
es: Servicio API en ejecución
fr: Service API en cours
ja: APIサービスは実行中です
ko: API 서비스가 실행 중입니다
pt_br: Serviço de API em execução
ru: Служба API работает
zh_hant: API 服務運行中

source: API 版本（可选）
ar: إصدار واجهة برمجة التطبيقات (اختياري)
de: API-Version (optional)
en: API version (optional)
es: Versión API (opcional)
fr: Version API (facultatif)
ja: APIバージョン（オプション）
ko: API 버전(선택사항)
pt_br: Versão da API (opcional)
ru: Версия API (необязательно)
zh_hant: API 版本（可選）

source: API 调试
ar: تصحيح أخطاء API
de: API-Debugging
en: API debugging
es: Depuración de API
fr: Débogage de l'API
ja: APIのデバッグ
ko: API 디버깅
pt_br: Depuração de API
ru: Отладка API
zh_hant: API 調試

source: API 运行中
ar: تشغيل واجهة برمجة التطبيقات
de: API läuft
en: API running
es: API en ejecución
fr: API en cours d'exécution
ja: API実行中
ko: API 실행 중
pt_br: API em execução
ru: API работает
zh_hant: API 運行中

source: APIMart 账户可用模型
ar: نماذج APIMart المتاحة لهذا الحساب
de: Für dieses Konto verfügbare APIMart-Modelle
en: APIMart models available to this account
es: Modelos de APIMart disponibles para esta cuenta
fr: Modèles APIMart disponibles pour ce compte
ja: このアカウントで利用可能なAPIMartモデル
ko: 이 계정에서 사용 가능한 APIMart 모델
pt_br: Modelos APIMart disponíveis para esta conta
ru: Модели APIMart, доступные этой учётной записи
zh_hant: APIMart 賬戶可用模型

source: Base URL
ar: عنوان URL الأساسي
de: Basis-URL
es: URL base
fr: URL de base
pt_br: URL base
ru: Базовый URL

source: Base URL 始终按原样保存；切换供应商类型不会自动填写、补版本或追加路径。
ar: يُحفظ عنوان URL الأساسي كما أُدخل تمامًا، ولا يؤدي تغيير نوع المزوّد إلى إكماله أو إضافة إصدار أو مسار.
de: Die Basis-URL wird unverändert gespeichert. Ein Anbieterwechsel ergänzt weder Version noch Pfad.
en: The Base URL is always saved exactly as entered. Changing provider type will not fill it, add a version, or append a path.
es: La URL base siempre se guarda tal como se introdujo. Cambiar el tipo de proveedor no la rellenará ni añadirá una versión o ruta.
fr: L’URL de base est toujours enregistrée telle quelle. Changer de fournisseur ne la complète pas et n’ajoute ni version ni chemin.
ja: Base URL は入力どおりに保存されます。プロバイダー種類を変更しても、自動入力、バージョン補完、パス追加は行いません。
ko: Base URL은 입력한 그대로 저장됩니다. 공급자 유형을 바꿔도 자동 입력, 버전 보완 또는 경로 추가를 하지 않습니다.
pt_br: A URL base é sempre salva exatamente como informada. Alterar o tipo de provedor não a preencherá nem adicionará versão ou caminho.
ru: Базовый URL всегда сохраняется без изменений. Смена типа поставщика не добавляет версию или путь.
zh_hant: Base URL 始終按原樣保存；切換供應商類型不會自動填寫、補版本或追加路徑。

source: CLI 配置预览
ar: معاينة تكوين CLI
de: Vorschau der CLI-Konfiguration
en: CLI configuration preview
es: Vista previa de la configuración CLI
fr: Aperçu de la configuration CLI
ja: CLI 構成のプレビュー
ko: CLI 구성 미리보기
pt_br: Pré-visualização da configuração CLI
ru: Предварительный просмотр конфигурации CLI
zh_hant: CLI 配置預覽

source: CLI 配置预览已复制；占位符未包含任何真实令牌。
ar: تم نسخ معاينة إعداد CLI. لا تحتوي العناصر النائبة على رموز حقيقية.
de: CLI-Konfigurationsvorschau kopiert. Die Platzhalter enthalten keine echten Token.
en: CLI configuration preview copied. Its placeholders contain no real tokens.
es: Vista previa de configuración de CLI copiada. Los marcadores no contienen tokens reales.
fr: Aperçu de configuration CLI copié. Les espaces réservés ne contiennent aucun jeton réel.
ja: CLI設定プレビューをコピーしました。プレースホルダーに実際のトークンは含まれません。
ko: CLI 구성 미리보기를 복사했습니다. 자리표시자에는 실제 토큰이 없습니다.
pt_br: Prévia da configuração da CLI copiada. Os espaços reservados não contêm tokens reais.
ru: Предпросмотр конфигурации CLI скопирован. Заполнители не содержат реальных токенов.
zh_hant: CLI 配置預覽已複製；佔位符未包含任何真實令牌。

source: Cohere 账户可用模型
ar: نماذج Cohere المتاحة لهذا الحساب
de: Für dieses Konto verfügbare Cohere-Modelle
en: Cohere models available to this account
es: Modelos de Cohere disponibles para esta cuenta
fr: Modèles Cohere disponibles pour ce compte
ja: Cohere アカウントで利用可能なモデル
ko: Cohere 계정에서 사용 가능한 모델
pt_br: Modelos Cohere disponíveis para esta conta
ru: Модели Cohere, доступные этой учётной записи
zh_hant: Cohere 賬戶可用模型

source: CSV 只接受 UTF-8 编码的 .csv 文件。必填列：model（也支持“模型名称”）；可选列：endpoint、各协议端点、input_price、output_price、price_source。价格单位为美元/百万 Token。
ar: يقبل استيراد CSV ملفات ‎.csv بترميز UTF-8 فقط. العمود المطلوب: model (أو 模型名称). الأعمدة الاختيارية: endpoint ونقاط نهاية البروتوكولات وinput_price وoutput_price وprice_source. الأسعار بالدولار لكل مليون رمز.
de: Der CSV-Import akzeptiert nur UTF-8-kodierte .csv-Dateien. Pflichtspalte: model (oder 模型名称). Optional: endpoint, protokollspezifische Endpunkte, input_price, output_price und price_source. Preise sind USD pro Million Token.
en: CSV only accepts UTF-8 encoded .csv files. Required columns: model (also supports "model name"); optional columns: endpoint, each protocol endpoint, input_price, output_price, price_source. The price unit is USD/million Tokens.
es: La importación CSV solo acepta archivos .csv UTF-8. Columna obligatoria: model (o 模型名称). Opcionales: endpoint, endpoints por protocolo, input_price, output_price y price_source. Los precios son USD por millón de tokens.
fr: L’import CSV accepte uniquement les fichiers .csv UTF-8. Colonne requise : model (ou 模型名称). Colonnes facultatives : endpoint, points de terminaison par protocole, input_price, output_price et price_source. Les tarifs sont en USD par million de jetons.
ja: CSV は UTF-8 の .csv ファイルのみ対応します。必須列：model（または「模型名称」）。任意列：endpoint、各プロトコルのエンドポイント、input_price、output_price、price_source。価格単位は 100 万トークン当たりの米ドルです。
ko: CSV 가져오기는 UTF-8 .csv 파일만 지원합니다. 필수 열: model(또는 模型名称). 선택 열: endpoint, 프로토콜별 엔드포인트, input_price, output_price, price_source. 가격 단위는 백만 토큰당 USD입니다.
pt_br: A importação CSV aceita apenas arquivos .csv em UTF-8. Coluna obrigatória: model (ou 模型名称). Opcionais: endpoint, endpoints por protocolo, input_price, output_price e price_source. Os preços são em USD por milhão de tokens.
ru: Импортируются только CSV-файлы в UTF-8. Обязательный столбец: model (или 模型名称). Необязательные: endpoint, адреса протоколов, input_price, output_price и price_source. Цены указываются в USD за миллион токенов.
zh_hant: CSV 只接受 UTF-8 編碼的 .csv 文件。必填列：model（也支持“模型名稱”）；可選列：endpoint、各協議端點、input_price、output_price、price_source。價格單位為美元/百萬 Token。

source: CSV 导入只会在确认后合并所选模型、价格和精确端点；不会修改 Base URL，也不会把模型标记为可用。
ar: لا يدمج استيراد CSV النماذج والأسعار ونقاط النهاية الدقيقة المحددة إلا بعد التأكيد، ولا يغيّر عنوان URL الأساسي ولا يضع علامة متاح على النماذج.
de: Der CSV-Import führt ausgewählte Modelle, Preise und exakte Endpunkte erst nach Bestätigung zusammen. Er ändert weder die Basis-URL noch markiert er Modelle als verfügbar.
en: CSV import merges selected models, prices, and exact endpoints only after confirmation. It does not change the Base URL or mark models as available.
es: La importación CSV solo combina los modelos, precios y endpoints exactos seleccionados tras la confirmación. No cambia la URL base ni marca modelos como disponibles.
fr: L’import CSV fusionne uniquement les modèles, tarifs et points de terminaison exacts sélectionnés après confirmation. Il ne modifie pas l’URL de base et ne marque pas les modèles comme disponibles.
ja: CSV インポートは確認後に選択したモデル、価格、正確なエンドポイントだけを統合します。Base URL は変更せず、モデルを利用可能にも設定しません。
ko: CSV 가져오기는 확인 후 선택한 모델, 가격, 정확한 엔드포인트만 병합합니다. Base URL을 변경하거나 모델을 사용 가능으로 표시하지 않습니다.
pt_br: A importação CSV só mescla os modelos, preços e endpoints exatos selecionados após confirmação. Ela não altera a URL base nem marca modelos como disponíveis.
ru: CSV-импорт объединяет выбранные модели, цены и точные адреса только после подтверждения. Базовый URL не меняется, модели не отмечаются доступными.
zh_hant: CSV 導入只會在確認後合併所選模型、價格和精確端點；不會修改 Base URL，也不會把模型標記為可用。

source: CSV 支持 UTF-8、UTF-16 与 Excel 分隔符声明。必填列：model（也支持 model_id、模型名称）；可选列：endpoint、各协议端点、input_price、output_price、request_price、price_source。Token 价格单位为美元/百万 Token，request_price 为美元/次。
ar: يدعم CSV ترميزَي UTF-8 وUTF-16 وتصريح فاصل Excel. العمود المطلوب: model (وكذلك model_id أو 模型名称). الاختيارية: endpoint ونقاط نهاية البروتوكولات وinput_price وoutput_price وrequest_price وprice_source. أسعار الرموز بالدولار لكل مليون، وrequest_price بالدولار لكل طلب.
de: CSV unterstützt UTF-8, UTF-16 und Excel-Trennzeichendeklarationen. Pflicht: model (auch model_id oder 模型名称). Optional: endpoint, Protokoll-Endpunkte, input_price, output_price, request_price und price_source. Tokenpreise sind USD pro Million Token; request_price ist USD pro Anfrage.
en: CSV supports UTF-8, UTF-16 and Excel delimiter declarations. Required columns: model (model_id, model name is also supported); optional columns: endpoint, each protocol endpoint, input_price, output_price, request_price, price_source. Token price unit is USD/million Token, request_price is USD/time.
es: CSV admite UTF-8, UTF-16 y declaraciones de separador de Excel. Obligatoria: model (también model_id o 模型名称). Opcionales: endpoint, endpoints por protocolo, input_price, output_price, request_price y price_source. Los precios de tokens son USD por millón; request_price es USD por solicitud.
fr: Le CSV prend en charge UTF-8, UTF-16 et les déclarations de séparateur Excel. Colonne requise : model (aussi model_id ou 模型名称). Facultatives : endpoint, points de terminaison par protocole, input_price, output_price, request_price et price_source. Les tarifs de jetons sont en USD par million ; request_price en USD par requête.
ja: CSV は UTF-8、UTF-16、Excel の区切り文字宣言に対応します。必須列：model（model_id、模型名称も可）。任意列：endpoint、各プロトコルのエンドポイント、input_price、output_price、request_price、price_source。トークン価格は 100 万トークン当たり USD、request_price は 1 リクエスト当たり USD です。
ko: CSV는 UTF-8, UTF-16 및 Excel 구분자 선언을 지원합니다. 필수 열: model(model_id, 模型名称 지원). 선택 열: endpoint, 프로토콜별 엔드포인트, input_price, output_price, request_price, price_source. 토큰 가격은 백만 토큰당 USD, request_price는 요청당 USD입니다.
pt_br: CSV aceita UTF-8, UTF-16 e declarações de separador do Excel. Obrigatória: model (também model_id ou 模型名称). Opcionais: endpoint, endpoints por protocolo, input_price, output_price, request_price e price_source. Preços de tokens usam USD por milhão; request_price usa USD por solicitação.
ru: CSV поддерживает UTF-8, UTF-16 и объявления разделителя Excel. Обязательный столбец: model (также model_id или 模型名称). Необязательные: endpoint, адреса протоколов, input_price, output_price, request_price и price_source. Цены токенов — USD за миллион, request_price — USD за запрос.
zh_hant: CSV 支持 UTF-8、UTF-16 與 Excel 分隔符聲明。必填列：model（也支持 model_id、模型名稱）；可選列：endpoint、各協議端點、input_price、output_price、request_price、price_source。Token 價格單位為美元/百萬 Token，request_price 為美元/次。

source: CSV 文件中没有可导入的模型
ar: لا يحتوي ملف CSV على نماذج قابلة للاستيراد
de: Die CSV-Datei enthält keine importierbaren Modelle
en: The CSV file contains no importable models
es: El archivo CSV no contiene modelos importables
fr: Le fichier CSV ne contient aucun modèle importable
ja: CSV ファイルにインポート可能なモデルがありません
ko: CSV 파일에 가져올 수 있는 모델이 없습니다
pt_br: O arquivo CSV não contém modelos importáveis
ru: В CSV-файле нет моделей для импорта
zh_hant: CSV 文件中沒有可導入的模型

source: CSV 文件必须使用 UTF-8 或 UTF-16 编码
ar: يجب أن يستخدم ملف CSV ترميز UTF-8 أو UTF-16
de: Die CSV-Datei muss UTF-8- oder UTF-16-kodiert sein
en: The CSV file must use UTF-8 or UTF-16 encoding
es: El archivo CSV debe usar codificación UTF-8 o UTF-16
fr: Le fichier CSV doit être encodé en UTF-8 ou UTF-16
ja: CSV ファイルは UTF-8 または UTF-16 である必要があります
ko: CSV 파일은 UTF-8 또는 UTF-16 인코딩이어야 합니다
pt_br: O arquivo CSV deve usar codificação UTF-8 ou UTF-16
ru: CSV-файл должен использовать UTF-8 или UTF-16
zh_hant: CSV 文件必須使用 UTF-8 或 UTF-16 編碼

source: CSV 文件必须使用 UTF-8 编码
ar: يجب أن يستخدم ملف CSV ترميز UTF-8
de: Die CSV-Datei muss UTF-8-kodiert sein
en: The CSV file must use UTF-8 encoding
es: El archivo CSV debe usar codificación UTF-8
fr: Le fichier CSV doit être encodé en UTF-8
ja: CSV ファイルは UTF-8 である必要があります
ko: CSV 파일은 UTF-8 인코딩이어야 합니다
pt_br: O arquivo CSV deve usar codificação UTF-8
ru: CSV-файл должен быть в кодировке UTF-8
zh_hant: CSV 文件必須使用 UTF-8 編碼

source: CSV 文件缺少表头
ar: يفتقد ملف CSV إلى صف العناوين
de: Der CSV-Datei fehlt eine Kopfzeile
en: The CSV file is missing a header row
es: Falta la fila de encabezado en el archivo CSV
fr: La ligne d’en-tête manque dans le fichier CSV
ja: CSV ファイルにヘッダー行がありません
ko: CSV 파일에 헤더 행이 없습니다
pt_br: O arquivo CSV não tem linha de cabeçalho
ru: В CSV-файле отсутствует строка заголовков
zh_hant: CSV 文件缺少表頭

source: CSV 文件超过安全上限（%lld MiB）
ar: يتجاوز ملف CSV حد الأمان (%lld MiB)
de: Die CSV-Datei überschreitet das Sicherheitslimit (%lld MiB)
en: The CSV file exceeds the safety limit (%lld MiB)
es: El archivo CSV supera el límite de seguridad (%lld MiB)
fr: Le fichier CSV dépasse la limite de sécurité (%lld Mio)
ja: CSV ファイルが安全上限（%lld MiB）を超えています
ko: CSV 파일이 안전 한도(%lld MiB)를 초과합니다
pt_br: O arquivo CSV excede o limite de segurança (%lld MiB)
ru: CSV-файл превышает безопасный предел (%lld МиБ)
zh_hant: CSV 文件超過安全上限（%lld MiB）

source: CSV 模型数量超过安全上限（%lld）
ar: يتجاوز عدد نماذج CSV حد الأمان (%lld)
de: Die Anzahl der CSV-Modelle überschreitet das Sicherheitslimit (%lld)
en: The number of CSV models exceeds the safety limit (%lld)
es: El número de modelos del CSV supera el límite de seguridad (%lld)
fr: Le nombre de modèles CSV dépasse la limite de sécurité (%lld)
ja: CSV のモデル数が安全上限（%lld）を超えています
ko: CSV 모델 수가 안전 한도(%lld)를 초과합니다
pt_br: O número de modelos CSV excede o limite de segurança (%lld)
ru: Число моделей в CSV превышает безопасный предел (%lld)
zh_hant: CSV 模型數量超過安全上限（%lld）

source: CSV 第 %lld 行的 %@ 必须是大于或等于 0 的数字
ar: صف CSV رقم %lld: يجب أن تكون %@ رقمًا أكبر من أو يساوي 0
de: CSV-Zeile %lld: %@ muss eine Zahl größer oder gleich 0 sein
en: CSV row %lld: %@ must be a number greater than or equal to 0
es: Fila %lld del CSV: %@ debe ser un número mayor o igual que 0
fr: Ligne %lld du CSV : %@ doit être un nombre supérieur ou égal à 0
ja: CSV の %lld 行目：%@ は 0 以上の数値である必要があります
ko: CSV %lld행: %@은(는) 0 이상의 숫자여야 합니다
pt_br: Linha %lld do CSV: %@ deve ser um número maior ou igual a 0
ru: Строка CSV %lld: %@ должно быть числом не меньше 0
zh_hant: CSV 第 %lld 行的 %@ 必須是大於或等於 0 的數字

source: CSV 第 %lld 行的 %@ 必须是无凭证的完整 HTTP(S) URL
ar: صف CSV رقم %lld: يجب أن تكون %@ عنوان HTTP(S) كاملاً دون بيانات اعتماد
de: CSV-Zeile %lld: %@ muss eine vollständige HTTP(S)-URL ohne Anmeldedaten sein
en: CSV row %lld: %@ must be a complete HTTP(S) URL without credentials
es: Fila %lld del CSV: %@ debe ser una URL HTTP(S) completa y sin credenciales
fr: Ligne %lld du CSV : %@ doit être une URL HTTP(S) complète sans identifiants
ja: CSV の %lld 行目：%@ は認証情報を含まない完全な HTTP(S) URL である必要があります
ko: CSV %lld행: %@은(는) 자격 증명이 없는 완전한 HTTP(S) URL이어야 합니다
pt_br: Linha %lld do CSV: %@ deve ser uma URL HTTP(S) completa sem credenciais
ru: Строка CSV %lld: %@ должен быть полным HTTP(S)-URL без учётных данных
zh_hant: CSV 第 %lld 行的 %@ 必須是無憑證的完整 HTTP(S) URL

source: CSV 第 %lld 行的引号格式不完整
ar: يحتوي صف CSV رقم %lld على حقل مقتبس غير مكتمل
de: CSV-Zeile %lld enthält ein unvollständig zitiertes Feld
en: CSV row %lld has an incomplete quoted field
es: La fila %lld del CSV tiene un campo entrecomillado incompleto
fr: La ligne %lld du CSV contient un champ entre guillemets incomplet
ja: CSV の %lld 行目の引用符形式が不完全です
ko: CSV %lld행의 따옴표 형식이 완전하지 않습니다
pt_br: A linha %lld do CSV tem um campo entre aspas incompleto
ru: В строке CSV %lld не закрыто поле в кавычках
zh_hant: CSV 第 %lld 行的引號格式不完整

source: CSV 第 %lld 行的模型名称为空、过长或包含控制字符
ar: اسم النموذج في صف CSV رقم %lld فارغ أو طويل جدًا أو يحتوي على محارف تحكم
de: CSV-Zeile %lld enthält einen leeren oder zu langen Modellnamen oder Steuerzeichen
en: CSV row %lld has an empty or overly long model name, or contains control characters
es: La fila %lld del CSV tiene un nombre de modelo vacío, demasiado largo o con caracteres de control
fr: La ligne %lld du CSV contient un nom de modèle vide, trop long ou avec des caractères de contrôle
ja: CSV の %lld 行目のモデル名が空、長すぎる、または制御文字を含んでいます
ko: CSV %lld행의 모델 이름이 비어 있거나 너무 길거나 제어 문자를 포함합니다
pt_br: A linha %lld do CSV tem um nome de modelo vazio, longo demais ou com caracteres de controle
ru: В строке CSV %lld имя модели пустое, слишком длинное или содержит управляющие символы
zh_hant: CSV 第 %lld 行的模型名稱為空、過長或包含控制字符
